doc/html/elements/textbox_autocomplete.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Textbox Autocomplete Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Textbox Autocomplete Element"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-11-12 19:50:45 CST"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Textbox Autocomplete Element</h1>

<p><a href="http://nitrogenproject.com">Home</a> | <a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html"><b>Elements</b></a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html">Handlers</a> | <a href="../config.html">Configuration Options</a> | <a href="../advanced.html">Advanced Guides</a> | <a href="../troubleshooting.html">Troubleshooting</a> | <a href="../about.html">About</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Textbox Autocomplete Element - #textbox_autocomplete {}</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Textbox Autocomplete Element - #textbox_autocomplete {}</h2>
<div class="outline-text-2" id="text-1">


<p>
  The textbox_autocomplete element produces an HTML textbox with built-in
  autocomplete functionality through the use of server postbacks for selecting
  and element and typing an element
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Usage</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="src src-erlang">#<span class="org-type">textbox_autocomplete</span> { tag=lookup }
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Events</h3>
<div class="outline-text-3" id="text-1-2">





<pre class="src src-erlang"><span class="org-function-name">autocomplete_enter_event</span>(<span class="org-variable-name">SearchTerm</span>, <span class="org-variable-name">Tag</span>) -&gt;
   <span class="org-variable-name">_JsonString</span> = <span class="org-type">some_search_function</span>(<span class="org-variable-name">SearchTerm</span>),

<span class="org-function-name">autocomplete_select_event</span>({struct, [{&lt;&lt;<span class="org-string">"id"</span>&gt;&gt;,<span class="org-variable-name">ID</span> }, {&lt;&lt;<span class="org-string">"value"</span>&gt;&gt;, <span class="org-variable-name">Value</span>}]}, <span class="org-variable-name">Tag</span>) -&gt;
   <span class="org-type">wf</span>:<span class="org-type">flash</span>(<span class="org-type">wf</span>:<span class="org-type">f</span>(<span class="org-string">"Selected ~p:~p"</span>,[<span class="org-variable-name">ID</span>, <span class="org-variable-name">Value</span>])).  
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> Core Attributes</h3>
<div class="outline-text-3" id="text-1-3">


<p>
   Core attributes copied from <a href="./textbox.html">#textbox{}</a>
</p>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3"></span> Attributes</h3>
<div class="outline-text-3" id="text-1-4">


<dl>
<dt>tag (<i>Erlang Term</i>)</dt><dd>The tag to be passed to the
      <code>autocomplete_enter_event</code> and <code>autocomplete_select_event</code> functions.
</dd>
</dl>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-5">


<ul>
<li><a href="./base.html">base element</a>

</li>
<li><a href="./button.html">button element</a>

</li>
<li><a href="./textbox.html">textbox element</a>

</li>
<li><a href="./textarea.html">textarea element</a>

</li>
<li><a href="./checkbox.html">checkbox element</a>

</li>
<li><a href="./dropdown.html">dropdown element</a>

</li>
<li><a href="./option.html">option element</a>

</li>
<li><a href="http://nitrogenproject.com/demos/textbox_autocomplete">Textbox Autocomplete Demo</a>
</li>
</ul>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-11-12 19:50:45 CST</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/elements/textbox_autocomplete.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
